Revit 2027 API
RebarContainerItem.SetPresentationMode Method
 Sets the presentation mode for this rebar set when displayed in the given view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetPresentationMode(
	View dBView,
	RebarPresentationMode presentationMode
)
Public Sub SetPresentationMode (
	dBView As View,
	presentationMode As RebarPresentationMode
)
public:
void SetPresentationMode(
	View^ dBView,
	RebarPresentationMode presentationMode
)
member SetPresentationMode :
        dBView : View *
        presentationMode : RebarPresentationMode -> unit
Parameters
dBView View
 The view.
presentationMode RebarPresentationMode
 The presentation mode.
Exceptions
Exception | Condition
ArgumentException |  This rebar cannot have a presentation mode applied for dBView, as the view is not valid for rebar presentation, or the orientation of the view matches the normal direction of the rebar.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace